Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/after_your_baby_is_born/maternity_care_and_public_health_nurse.html.txt.tmx
Source language: en
Languages: ga

source: Maternity care and the public health nurse
ga: Cúram máithreachais agus an bhanaltra sláinte phoiblí

source: If you have had your baby in hospital, your first point of contact will be the public health nurse, who will visit you shortly after you come home
ga: Má bhí páiste san ospidéal agat tiocfaidh an bhanaltra sláinte phoiblí ar cuairt chugat go luath tar éis duit filleadh ar an mbaile

source: They will have been informed of the birth of your baby and will either call to your home or phone you to make an appointment
ga: (má rúgadh an páiste sa bhaile beidh cleachtadh agat ar an mbean chabhartha teacht ar cuairt chugat)

source: (If you have had a home birth or domino delivery, your midwife will have already visited you)
ga: Beidh eolas curtha chuig an mbanaltra gur rugadh páiste duit agus tiocfaidh sé/sí ag an teach nó cuirfidh siad glaoch le coinne a dhéanamh leat

source: Public health nurses can help you with the following :
ga: Tá cúnamh ar fáil ó na banaltraí sláinte poiblí leis na rudaí seo a leanas:

source: • Advice and support: Public health nurses have extensive experience of babies and children and will be able to answer any queries you might have
ga: • Comhairle agus tacaíocht: Tá taithí mhaith ag banaltraí sláinte poiblí ar naíonáin agus ar pháistí agus beidh siad in ann aon cheisteanna a bheadh agat a fhreagairt duit

source: • Breastfeeding: Your public health nurse may run a breastfeeding support group at your health centre, generally once a week
ga: • Cothú cíche: B'fhéidir go mbeadh grúpa tacaíochta do chothú cíche ag an mbanaltra sláinte poiblí ag an ionad sláinte, lá sa tseachtain go hiondúil

source: This will give you the opportunity to discuss any problems or queries you might have and to meet other breastfeeding mothers
ga: Beidh deis agat ansin aon fhadhabanna atá agat a phlé nó aon cheisteanna a chur agus castáil le máithreacha eile atá ag cothú a gcuid naíonán iad féin

source: • Feeding: When you begin to feed your baby solid food, your public health nurse will be able to advise you on developing a good balanced diet for your baby
ga: • Cothú: Nuair a thosnaíonn tú ar bhia tirim a thabhairt don pháiste beidh an bhanaltra sláinte phoiblí in ann comhairle a thabhairt duit maidir le bia maith sláintiúil

source: • Developmental Checks: Examinations of your baby's development are provided free of charge at your local health centre
ga: • Scrúduithe Forbartha: Is féidir scrúdú a fháil déanta ar fhorbairt an pháiste saor in aisce ag an ionad sláinte áitiúil

source: The public health nurse will check your baby's development against a series of "norms" for that age group
ga: Déanfaidh an bhanaltra sláinte phoiblí scrúdú ar fhorbairt do pháiste bunaithe ar an ngnáthchaighdeán a bhíonn ag páistí den aois chéanna

source: For example, at 9 months, the checks look at your baby's eyesight and hearing, motor development, vocalisation and general growth
ga: Mar shampla ag 9 mí, déanfar scrúdú ar amharc, éisteacht, forbairt luaile, fuaimeanna agus fás ginearálta an pháiste

source: The checks are generally carried out at 9 months, 18 months and 2 years, and you will receive a reminder call from your public health nurse
ga: Ag naoi mí, 18 mí agus ag dhá bhliain go hiondúil a bhíonn na scrúduithe seo déanta agus tiocfaidh scéal ón mbanaltra sláinte phoiblí dhá meabhrú duit

source: If you do not, call your local health centre to make an appointment
ga: Muna bhfaigheann tú aon scéal cuir glaoch ar an ionad sláinte le coinne a dhéanamh

source: The checks are not mandatory
ga: Níl aon dualgas ort na scrúduithe a fháil déanta

source: The public health nurse is also a good first point of contact should you have any concerns about your baby's development
ga: Má tá aon imní ort faoi fhorbairt do pháiste is maith an rud é teagmháil a dhéanamh leis an mbanaltra sláinte phoiblí ar an gcéad dul síos

source: Where to apply
ga: Cá háit a ndéanfaidh mé iarratas

source: You will be automatically contacted by your public health nurse following the birth of your baby. Contact information for the service is through your local health centre
ga: Tiocfaidh an bhanaltra sláinte phoiblí i dteagmháil leat ach más mian leat féin teagmháil a dhéanamh leis an ionad sláinte poiblí, déan teagmháil leis an ionad sláinte áitiúil
